; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   grey_block_1 white_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (or (and (= ?obj grey_block_1) (= ?underobj white_block_1)) (on grey_block_1 white_block_1)) (hold_0)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (and (on grey_block_1 white_block_1) (not (and (= ?obj grey_block_1) (= ?underobj white_block_1)))) (hold_0)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
   green_block_1 brown_block_1 green_block_2 - block
 )
 (:init (ontable green_block_1) (on brown_block_1 green_block_1) (on grey_block_1 brown_block_1) (on green_block_2 grey_block_1) (ontable white_block_1) (clear green_block_2) (clear white_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (on white_block_1 brown_block_1) (hold_0)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack green_block_2 grey_block_1)
   deleted: (on green_block_2 grey_block_1) (clear green_block_2) (handempty)
   added: (holding green_block_2) (clear grey_block_1)
   goals met: 0 of 2
2. (putdown green_block_2)
   deleted: (holding green_block_2)
   added: (clear green_block_2) (handempty) (ontable green_block_2)
   goals met: 0 of 2
3. (unstack grey_block_1 brown_block_1)
   deleted: (on grey_block_1 brown_block_1) (clear grey_block_1) (handempty)
   added: (holding grey_block_1) (clear brown_block_1)
   goals met: 0 of 2
4. (putdown grey_block_1)
   deleted: (holding grey_block_1)
   added: (clear grey_block_1) (handempty) (ontable grey_block_1)
   goals met: 0 of 2
5. (pickup white_block_1)
   deleted: (clear white_block_1) (ontable white_block_1) (handempty)
   added: (holding white_block_1)
   goals met: 0 of 2
6. (stack white_block_1 brown_block_1)
   deleted: (clear brown_block_1) (holding white_block_1)
   added: (handempty) (clear white_block_1) (on white_block_1 brown_block_1)
   goals met: 1 of 2
7. (pickup grey_block_1)
   deleted: (clear grey_block_1) (ontable grey_block_1) (handempty)
   added: (holding grey_block_1)
   goals met: 1 of 2
8. (stack grey_block_1 white_block_1)
   deleted: (clear white_block_1) (holding grey_block_1)
   added: (handempty) (clear grey_block_1) (on grey_block_1 white_block_1) (hold_0)
   goals met: 2 of 2
